toko-api/app/Controllers/LoginController.php

    public function login()
    {
        $email    = $this->request->getVar('email');
        $password = $this->request->getVar('password');

        $model  = new MMember();
        $member = $model->where(['email' => $email])->first();
---
SELECT *
FROM `member`
WHERE `email` = 'amarsaja42@gmail.com'
 LIMIT 1